Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70N20.xml
        <register caption="PTP Peer Event Frame Received Nanoseconds Register" name="GMAC_PEFRN" offset="0x1FC" rw="R" size="4">
          <bitfield caption="Register Update" mask="0x3FFFFFFF" name="RUD"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue  (index = 1) 0" name="GMAC_ISRPQ0" offset="0x400" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue  (index = 1) 1" name="GMAC_ISRPQ1" offset="0x404" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Interrupt Status Register Priority Queue  (index = 1) 2" name="GMAC_ISRPQ2" offset="0x408" rw="R" size="4">
          <bitfield caption="Receive Complete" mask="0x00000002" name="RCOMP"/>
          <bitfield caption="RX Used Bit Read" mask="0x00000004" name="RXUBR"/>
          <bitfield caption="Retry Limit Exceeded or Late Collision" mask="0x00000020" name="RLEX"/>
          <bitfield caption="Transmit Frame Corruption Due to AHB Error" mask="0x00000040" name="TFC"/>
          <bitfield caption="Transmit Complete" mask="0x00000080" name="TCOMP"/>
          <bitfield caption="Receive Overrun" mask="0x00000400" name="ROVR"/>
          <bitfield caption="HRESP Not OK" mask="0x00000800" name="HRESP"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Register Priority Queue  (index = 1) 0" name="GMAC_TBQBAPQ0" offset="0x440" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Register Priority Queue  (index = 1) 1" name="GMAC_TBQBAPQ1" offset="0x444" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Transmit Buffer Queue Base Address Register Priority Queue  (index = 1) 2" name="GMAC_TBQBAPQ2" offset="0x448" rw="RW" size="4">
          <bitfield caption="Transmit Buffer Queue Base Address" mask="0x000000FC" name="TXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Register Priority Queue  (index = 1) 0" name="GMAC_RBQBAPQ0" offset="0x480" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Register Priority Queue  (index = 1) 1" name="GMAC_RBQBAPQ1" offset="0x484" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Queue Base Address Register Priority Queue  (index = 1) 2" name="GMAC_RBQBAPQ2" offset="0x488" rw="RW" size="4">
          <bitfield caption="Receive Buffer Queue Base Address" mask="0x000000FC" name="RXBQBA"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue  (index = 1) 0" name="GMAC_RBSRPQ0" offset="0x4A0" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue  (index = 1) 1" name="GMAC_RBSRPQ1" offset="0x4A4" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Receive Buffer Size Register Priority Queue  (index = 1) 2" name="GMAC_RBSRPQ2" offset="0x4A8" rw="RW" size="4">
          <bitfield caption="Receive Buffer Size" mask="0x0000FFFF" name="RBS"/>
        </register>
        <register caption="Credit-Based Shaping Control Register" name="GMAC_CBSCR" offset="0x4BC" rw="RW" size="4">
          <bitfield caption="Queue B CBS Enable" mask="0x00000001" name="QBE"/>
          <bitfield caption="Queue A CBS Enable" mask="0x00000002" name="QAE"/>
        </register>
        <register caption="Credit-Based Shaping IdleSlope Register for Queue A" name="GMAC_CBSISQA" offset="0x4C0" rw="RW" size="4">
          <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
        </register>
        <register caption="Credit-Based Shaping IdleSlope Register for Queue B" name="GMAC_CBSISQB" offset="0x4C4" rw="RW" size="4">
          <bitfield caption="IdleSlope" mask="0xFFFFFFFF" name="IS"/>
        </register>
        <register caption="Screening Type 1 Register Priority Queue  (index = 0) 0" name="GMAC_ST1RPQ0" offset="0x500" rw="RW" size="4">
          <bitfield caption="Queue Number (0-2)" mask="0x00000007" name="QNB"/>
          <bitfield caption="Differentiated Services or Traffic Class Match" mask="0x00000FF0" name="DSTCM"/>
          <bitfield caption="UDP Port Match" mask="0x0FFFF000" name="UDPM"/>
          <bitfield caption="Differentiated Services or Traffic Class Match Enable" mask="0x10000000" name="DSTCE"/>
          <bitfield caption="UDP Port Match Enable" mask="0x20000000" name="UDPE"/>
        </register>
