Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70N20.xml
        <register caption="Device Endpoint Set Register (n = 0) 8" name="USBHS_DEVEPTIFR8" offset="0x1B0" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Set Register (n = 0) 9" name="USBHS_DEVEPTIFR9" offset="0x1B4" rw="W" size="4">
          <bitfield caption="Transmitted IN Data Interrupt Set" mask="0x00000001" name="TXINIS"/>
          <bitfield caption="Received OUT Data Interrupt Set" mask="0x00000002" name="RXOUTIS"/>
          <bitfield caption="Received SETUP Interrupt Set" mask="0x00000004" name="RXSTPIS"/>
          <bitfield caption="NAKed OUT Interrupt Set" mask="0x00000008" name="NAKOUTIS"/>
          <bitfield caption="NAKed IN Interrupt Set" mask="0x00000010" name="NAKINIS"/>
          <bitfield caption="Overflow Interrupt Set" mask="0x00000020" name="OVERFIS"/>
          <bitfield caption="STALLed Interrupt Set" mask="0x00000040" name="STALLEDIS"/>
          <bitfield caption="Short Packet Interrupt Set" mask="0x00000080" name="SHORTPACKETS"/>
          <bitfield caption="Number of Busy Banks Interrupt Set" mask="0x00001000" name="NBUSYBKS"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 0" name="USBHS_DEVEPTIMR0" offset="0x1C0" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 1" name="USBHS_DEVEPTIMR1" offset="0x1C4" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 2" name="USBHS_DEVEPTIMR2" offset="0x1C8" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 3" name="USBHS_DEVEPTIMR3" offset="0x1CC" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
        <register caption="Device Endpoint Mask Register (n = 0) 4" name="USBHS_DEVEPTIMR4" offset="0x1D0" rw="R" size="4">
          <bitfield caption="Transmitted IN Data Interrupt" mask="0x00000001" name="TXINE"/>
          <bitfield caption="Received OUT Data Interrupt" mask="0x00000002" name="RXOUTE"/>
          <bitfield caption="Received SETUP Interrupt" mask="0x00000004" name="RXSTPE"/>
          <bitfield caption="NAKed OUT Interrupt" mask="0x00000008" name="NAKOUTE"/>
          <bitfield caption="NAKed IN Interrupt" mask="0x00000010" name="NAKINE"/>
          <bitfield caption="Overflow Interrupt" mask="0x00000020" name="OVERFE"/>
          <bitfield caption="STALLed Interrupt" mask="0x00000040" name="STALLEDE"/>
          <bitfield caption="Short Packet Interrupt" mask="0x00000080" name="SHORTPACKETE"/>
          <bitfield caption="Number of Busy Banks Interrupt" mask="0x00001000" name="NBUSYBKE"/>
          <bitfield caption="Kill IN Bank" mask="0x00002000" name="KILLBK"/>
          <bitfield caption="FIFO Control" mask="0x00004000" name="FIFOCON"/>
          <bitfield caption="Endpoint Interrupts Disable HDMA Request" mask="0x00010000" name="EPDISHDMA"/>
          <bitfield caption="NYET Token Disable" mask="0x00020000" name="NYETDIS"/>
          <bitfield caption="Reset Data Toggle" mask="0x00040000" name="RSTDT"/>
          <bitfield caption="STALL Request" mask="0x00080000" name="STALLRQ"/>
        </register>
