Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAME70N20.xml
      <value-group caption="" name="USBHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__NBTRANS">
        <value caption="Reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="Default value: one transaction per microframe." name="_1_TRANS" value="0x1"/>
        <value caption="Two transactions per microframe. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="Three transactions per microframe. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__NBTRANS">
        <value caption="Reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="Default value: one transaction per microframe." name="_1_TRANS" value="0x1"/>
        <value caption="Two transactions per microframe. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="Three transactions per microframe. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPSIZE">
        <value caption="8 bytes" name="_8_BYTE" value="0x0"/>
        <value caption="16 bytes" name="_16_BYTE" value="0x1"/>
        <value caption="32 bytes" name="_32_BYTE" value="0x2"/>
        <value caption="64 bytes" name="_64_BYTE" value="0x3"/>
        <value caption="128 bytes" name="_128_BYTE" value="0x4"/>
        <value caption="256 bytes" name="_256_BYTE" value="0x5"/>
        <value caption="512 bytes" name="_512_BYTE" value="0x6"/>
        <value caption="1024 bytes" name="_1024_BYTE" value="0x7"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPDIR">
        <value caption="The endpoint direction is OUT." name="OUT" value="0"/>
        <value caption="The endpoint direction is IN (nor for control endpoints)." name="IN" value="1"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPTYPE">
        <value caption="Control" name="CTRL" value="0x0"/>
        <value caption="Isochronous" name="ISO" value="0x1"/>
        <value caption="Bulk" name="BLK" value="0x2"/>
        <value caption="Interrupt" name="INTRPT" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__NBTRANS">
        <value caption="Reserved to endpoint that does not have the high-bandwidth isochronous capability." name="_0_TRANS" value="0x0"/>
        <value caption="Default value: one transaction per microframe." name="_1_TRANS" value="0x1"/>
        <value caption="Two transactions per microframe. This endpoint should be configured as double-bank." name="_2_TRANS" value="0x2"/>
        <value caption="Three transactions per microframe. This endpoint should be configured as triple-bank." name="_3_TRANS" value="0x3"/>
      </value-group>
      <value-group caption="" name="USBHS_DEVEPTCFG__EPBK">
        <value caption="Single-bank endpoint" name="_1_BANK" value="0x0"/>
        <value caption="Double-bank endpoint" name="_2_BANK" value="0x1"/>
        <value caption="Triple-bank endpoint" name="_3_BANK" value="0x2"/>
      </value-group>
